import * as z from "zod";

export const schema = z.object({
    content: z
        .string()
        .min(100, { message: "Текст должен содержать минимум 100 символов" })
        .max(5000, {
            message:
                "Текст не должен содержать более 5000 символов. Для провреки большого текста загрузите файл",
        }),
    title: z
        .string()
        .min(3, { message: "Название должно содержать минимум 3 символова" })
        .max(50, { message: "Название должно содержать не более 30 символов" }),
});
