import * as z from "zod";

export const schema = z.object({
    university: z
        .string()
        .min(3, {
            message: "Название образовательного учреждения должно состоять хотя бы из 3 символов",
        })
        .max(30, {
            message: "Название образовательного учреждения не должно содержать более 30 символов",
        }),
    student: z
        .string()
        .min(3, { message: "Имя должно состоять хотя бы из 3 символов" })
        .max(30, { message: "Имя не должно содержать более 30 символов" }),
    reviewer: z
        .string()
        .min(3, { message: "Имя должно состоять хотя бы из 3 символов" })
        .max(30, { message: "Имя не должно содержать более 30 символов" }),
    department: z
        .string()
        .min(3, { message: "Название кафедры должно содержать минимум 3 символа" })
        .max(30, { message: "Название кафедры должно содержать не более 30 символов" }),
});
